#Использовать ".."

#Использовать asserts

Перем юТест;

Процедура Инициализация()
	
КонецПроцедуры

Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	юТест = Тестирование;
	
	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Тест_Должен_ПолучитьПоследнийНомерРелизаЗУП");
	СписокТестов.Добавить("Тест_Должен_СкачатьПоследнийРелизЗУП");
		
	Возврат СписокТестов;
	
КонецФункции

Процедура Тест_Должен_ПолучитьПоследнийНомерРелизаЗУП() Экспорт
	
	Данные = Новый Структура();
	Данные.Вставить("Тип","HRM");
	Данные.Вставить("Версия","25");
	Данные.Вставить("ВерсияПлатформы","82");

	МенеджерРелизов = Новый ПоследнийРелизКонфигурации;
	Результат = МенеджерРелизов.ПолучитьИнформацию(Данные);

	Ожидаем.Что(Результат.Версия).Содержит("2.5.");
	
КонецПроцедуры

Процедура Тест_Должен_СкачатьПоследнийРелизЗУП() Экспорт
	
	Данные = Новый Структура();
	Данные.Вставить("Тип","HRM");
	Данные.Вставить("Версия","25");
	Данные.Вставить("ПолнаяВерсия","25");
	Данные.Вставить("ВерсияПлатформы","82");
	Данные.Вставить("Логин","");
	Данные.Вставить("Пароль","");
	Данные.Вставить("КаталогСохранения","tests/arh/");

	МенеджерРелизов = Новый ПоследнийРелизКонфигурации;
	Информация = МенеджерРелизов.ПолучитьИнформацию(Данные);

	Если НЕ Информация = Неопределено Тогда
		Данные.ПолнаяВерсия = Информация.Версия;
		Результат = МенеджерРелизов.Скачать(Данные);

		Если Результат = Неопределено Тогда
			ВызватьИсключение "Ошибка при скачивании последнего релиза";
		Иначе
			Сообщить(Результат.ПолноеИмя);
		КонецЕсли;

	Иначе
		ВызватьИсключение "Получены ошибочные данные по последнему релизу";
	КонецЕсли;
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////
// Инициализация

Инициализация();