#Использовать ".."

#Использовать asserts

Перем юТест;

Процедура Инициализация()
	
КонецПроцедуры

Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	юТест = Тестирование;
	
	СписокТестов = Новый Массив;
	//СписокТестов.Добавить("Тест_Должен_СделатьБекап");
	СписокТестов.Добавить("Тест_Должен_СделатьБекапСервенойБазы");
	//СписокТестов.Добавить("Тест_Должен_СделатьГрубыйБекап");
		
	Возврат СписокТестов;
	
КонецФункции

Процедура Тест_Должен_СделатьБекапСервенойБазы() Экспорт
	
	Данные = Новый Структура();
	Данные.Вставить("ПутьКБазе","Srvr=localhost;Ref='BP3Demo'");
	Данные.Вставить("Логин","Любимов (администратор)");
	Данные.Вставить("Пароль","");
	Данные.Вставить("КаталогКопий","c:\work\db\site\copy-lessons\");
	Данные.Вставить("ИмяФайлаВыгрузки","bp3");
	Данные.Вставить("Суфикс","sql");

	РезервнаяКопия = Новый РезервнаяКопия;
	Результат = РезервнаяКопия.СделатьРезервнуюКопию(Данные);

	Ожидаем.Что(Результат).ЭтоИстина();
	
КонецПроцедуры

Процедура Тест_Должен_СделатьБекап() Экспорт
	
	Данные = Новый Структура();
	Данные.Вставить("ПутьКБазе","c:\work\db\site\lessons\");
	Данные.Вставить("Логин","Иванов");
	Данные.Вставить("Пароль","");
	Данные.Вставить("КаталогКопий","c:\work\db\site\copy-lessons\");
	Данные.Вставить("ИмяФайлаВыгрузки","les");
	Данные.Вставить("Суфикс","test");

	РезервнаяКопия = Новый РезервнаяКопия;
	Результат = РезервнаяКопия.СделатьРезервнуюКопию(Данные);

	Ожидаем.Что(Результат).ЭтоИстина();
	
КонецПроцедуры

Процедура Тест_Должен_СделатьГрубыйБекап() Экспорт
	
	Данные = Новый Структура();
	Данные.Вставить("ПутьКБазе","c:\work\db\site\lessons\");
	Данные.Вставить("Логин","Иванов");
	Данные.Вставить("Пароль","");
	Данные.Вставить("КаталогКопий","c:\work\db\site\copy-lessons\");
	Данные.Вставить("ИмяФайлаВыгрузки","les");
	Данные.Вставить("Суфикс","test");

	РезервнаяКопия = Новый РезервнаяКопия;
	Результат = РезервнаяКопия.СделатьГрубуюРезервнуюКопию(Данные);

	Ожидаем.Что(Результат).ЭтоИстина();
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////
// Инициализация

Инициализация();