#Использовать ".."

#Использовать asserts

Перем юТест;

Процедура Инициализация()
	
КонецПроцедуры

Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	юТест = Тестирование;
	
	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Тест_Должен_СделатьВыгрузку");
	СписокТестов.Добавить("Тест_Должен_СделатьВыгрузкуСервенойБазы");
	СписокТестов.Добавить("Тест_Должен_СделатьГрубуюВыгрузку");
	СписокТестов.Добавить("Тест_Должен_СделатьАрхив");
		
	Возврат СписокТестов;
	
КонецФункции

Процедура Тест_Должен_СделатьВыгрузкуСервенойБазы() Экспорт
	
	Данные = Новый Структура();
	Данные.Вставить("ПутьКБазе","Srvr=localhost;Ref='BP3Demo'");
	Данные.Вставить("Логин","Любимов (администратор)");
	Данные.Вставить("Пароль","");
	Данные.Вставить("КаталогКопий","c:\work\db\site\copy-lessons\");
	Данные.Вставить("ИмяФайлаВыгрузки","bp3");
	Данные.Вставить("Суфикс","sql");

	РезервнаяКопия = Новый РезервнаяКопия;
	Результат = РезервнаяКопия.СделатьВыгрузку(Данные);

	Ожидаем.Что(Результат).ЭтоИстина();
	
КонецПроцедуры

Процедура Тест_Должен_СделатьВыгрузку() Экспорт
	
	Данные = Новый Структура();
	Данные.Вставить("ПутьКБазе","c:\work\db\site\lessons\");
	Данные.Вставить("Логин","Иванов");
	Данные.Вставить("Пароль","");
	Данные.Вставить("КаталогКопий","c:\work\db\site\copy-lessons\");
	Данные.Вставить("ИмяФайлаВыгрузки","les");
	Данные.Вставить("Суфикс","test");

	РезервнаяКопия = Новый РезервнаяКопия;
	Результат = РезервнаяКопия.СделатьВыгрузку(Данные);

	Ожидаем.Что(Результат).ЭтоИстина();
	
КонецПроцедуры

Процедура Тест_Должен_СделатьГрубуюВыгрузку() Экспорт
	
	Данные = Новый Структура();
	Данные.Вставить("ПутьКБазе","c:\work\db\site\lessons\");
	Данные.Вставить("Логин","Иванов");
	Данные.Вставить("Пароль","");
	Данные.Вставить("КаталогКопий","c:\work\db\site\copy-lessons\");
	Данные.Вставить("ИмяФайлаВыгрузки","les-hard");
	Данные.Вставить("Суфикс","test");

	РезервнаяКопия = Новый РезервнаяКопия;
	Результат = РезервнаяКопия.СделатьГрубуюВыгрузку(Данные);

	Ожидаем.Что(Результат).ЭтоИстина();
	
КонецПроцедуры


Процедура Тест_Должен_СделатьАрхив() Экспорт

	Данные = Новый Структура;
	Данные.Вставить("Архиватор","c:\work\portable\7-Zip\7z.exe");
	Данные.Вставить("КлючиАрхиватора","a -ssw -r0");
	Данные.Вставить("ПутьКБазе","c:\work\db\v8_tasks\");
	Данные.Вставить("КаталогКопий","c:\work\db\site\copy-lessons\");
	Данные.Вставить("ИмяФайлаВыгрузки","tasks");
	Данные.Вставить("Суфикс","test");	

	РезервнаяКопия = Новый РезервнаяКопия;
	Результат = РезервнаяКопия.СоздатьАрхив(Данные);

	Ожидаем.Что(Результат).ЭтоИстина();
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////
// Инициализация

Инициализация();